Autodesk.Revit.DB.Electrical.ElectricalEquipment.SetCircuitNamingSchemeType(Autodesk.Revit.DB.Electrical.CircuitNaming)
Sets the circuit naming scheme for Electrical Equipment.
Remarks:
The following circuit naming scheme type can be set:
CircuitNaming::Prefixed
CircuitNaming::Standard
CircuitNaming::PanelName
CircuitNaming::Phase
CircuitNaming::ProjectSetting
For a customized circuit naming scheme, set its id directly with SetCircuitNamingSchemeId method.
circuitNamingType:
The enumerated type of circuit naming scheme to be set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The circuit naming scheme enumerated type is invalid for the Electrical Equipment.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2021

Autodesk.Revit.DB.Electrical.ElectricalEquipment.GetCircuitNamingSchemeType
Gets enumerated type of the circuit naming scheme used with Electrical Equipment.
Returns:
The enumerated type of circuit naming scheme.
Since:
2021

Autodesk.Revit.DB.Electrical.ElectricalEquipment.IsValidCircuitNamingSchemeId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Verifies that the circuit naming scheme id can be used with Electrical Equipment.
aDocument:
The document.
circuitNamingSchemeId:
The circuit naming scheme id to be checked.
Returns:
True if the circuit naming scheme id is valid for Electrical Equipment.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Electrical.ElectricalEquipment.IsValidDistributionSystem(Autodesk.Revit.DB.Electrical.DistributionSysType)
Verifies that the Distribution System can be assigned to the Electrical Equipment.
distributionSystem:
The Distribution System to be checked.
Returns:
True if the Distribution System can be assigned to the Electrical Equipment.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Electrical.ElectricalEquipment.IsSwitchboard
The electrical equipment is a switchboard or not.
This property returns true if the electrical equipment is a switchboard.
Since:
2021

Autodesk.Revit.DB.Electrical.ElectricalEquipment.MaxNumberOfCircuits
The maximum number of circuits for switchboard.
The quantity of circuits can be assigned to switchboard through breaker.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input max number of circuits value is invalid for switchboard.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The electrical equipment is not a switchboard equipment.
Since:
2021

Autodesk.Revit.DB.Electrical.ElectricalEquipment.CircuitNamingSchemeId
The CircuitNamingSchemeId used in the Electrical Equipment.
The CircuitNamingSchemeId is used to retrieve the circuit naming scheme id of the Electrical Equipment.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The circuit naming scheme id is invalid for the Electrical Equipment.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Electrical.ElectricalEquipment.DistributionSystem
get or set the Distribution System for the Electrical Equipment.
Remarks:
This property returns a Distribution System which is assigned to the Electrical Equipment.
If there are no Distribution System assigned to this Electrical Equipment,
this property will be null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The Distribution System can not be assigned to the Electrical Equipment.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.Electrical.ElectricalEquipment.#ctor(Autodesk.Revit.DB.FamilyInstance)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Electrical.ElectricalEquipment
Provides access to the Electrical Equipment in Autodesk Revit.